/* ================================================
 * 
 * ================================================
 * 制作者：宇留野陸斗
 * ------------------------------------------------
 * 2026-09-24 | 初回作成
 * ================================================ */


/// <summary>
/// 警察の移動状態を表す列挙型
/// </summary>
public enum CSE_PoliceMoveState
{
    /// <summary>
    /// 巡回状態
    /// </summary>
    Patrol,

    /// <summary>
    /// 追跡状態
    /// </summary>
    Chase,

    /// <summary>
    /// 駆け付け状態(警備エリア内で起きた事件の現場へ向かう)
    /// </summary>
    Rush,

    /// <summary>
    /// 探索状態(標的を見失った場所・駆け付けた現場を探す)
    /// </summary>
    Search
}
