/* ================================================
 *
 * ================================================
 * 制作者：宇留野陸斗
 * ------------------------------------------------
 * 2026-10-21 | 初回作成
 * ================================================ */

/// <summary>
/// 警察が標的を追いかける方法を表す列挙型
/// 警察ごと(警察のステータス)に決め、その警察は追いかける時、常にその方法で追いかける
/// </summary>
public enum CSE_PoliceChaseStyle
{
    /// <summary>
    /// 追尾(標的のいる位置へ向かい、そのまま後ろを追いかける)
    /// </summary>
    Direct,

    /// <summary>
    /// 先回り(標的の動く向きを予測して、その先へ回り込むように追いかける。近づいたら追尾に切り替える)
    /// </summary>
    Intercept,
}
